tap "browsh-org/browsh"
tap "caskroom/cask"
tap "charmbracelet/tap"
tap "cjbassi/gotop"
tap "dbcli/tap"
tap "dduan/formulae"
tap "eddieantonio/eddieantonio"
tap "gwolf3/craft"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "isacikgoz/taps"
tap "jesseduffield/lazydocker"
tap "k-vernooy/tap"
tap "kde-mac/kde"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "rigellute/tap"
tap "ringohub/redis-cli"
tap "srkomodo/tap"
tap "tsub/s3-edit"
tap "tylerbrock/saw"
tap "universal-ctags/universal-ctags"
tap "xo/xo"
cask "osxfuse"
cask "xquartz"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Utility to read Word (.doc) files
brew "antiword"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Client for Amazon CloudFormation web service
brew "aws-cfn-tools"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Utility for easily assuming AWS IAM roles from the command-line
brew "awsume"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Storage conversion and expression calculator
brew "bcal"
# Command-line benchmark tool
brew "bench"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Safely store secrets in Git/Mercurial/Subversion
brew "blackbox"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Change macOS display brightness from the command-line
brew "brightness"
# Powerful command-line bookmark manager
brew "buku"
# Arbitrary precision calculator
brew "calc"
# Text-based personal organizer
brew "calcurse"
# Bash and Zsh completion for Cargo
brew "cargo-completion"
# Robust and modular log colorizer
brew "ccze"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Ruby environment tool
brew "chruby"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Wrapper around make to colorize the output
brew "colormake"
# Like tail(1), but with various colors for specified output
brew "colortail"
# Tool for service discovery, monitoring and configuration
brew "consul"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Filesystem for accessing FTP hosts based on FUSE and libcurl
brew "curlftpfs"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# DuckDuckGo from the terminal
brew "ddgr"
# Display graphs and colors of file system space/usage
brew "dfc"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# LCS based diff highlighting tool to ease code review from your terminal
brew "diffr"
# Converts Microsoft Office docx documents to equivalent text documents
brew "docx2txt"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Bash script for interacting with Dropbox
brew "dropbox-uploader"
# Emoji on the command-line :scream:
brew "emojify"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Perl script to extracts URLs from emails or plain text
brew "extract_url"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# X11 image viewer
brew "feh"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Text-based UI library
brew "ncurses"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like front end for ZSH
brew "fizsh"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Find files with SQL-like queries
brew "fselect"
# Search through your filesystem with SQL-esque queries
brew "fsql"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
brew "gem-bundler"
brew "gem-colorls"
# Bash completion for gem
brew "gem-completion"
brew "gem-json"
brew "gem-neovim"
brew "gem-rake"
brew "gem-rouge"
brew "gem-terjira"
brew "gem-thyme"
brew "gem-tmuxinator"
# CLI to retrieve AWS credentials from Okta
brew "gimme-aws-creds"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Emoji guide for your commit messages
brew "gitmoji"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Simple jira command-line client in Go
brew "go-jira", link: false
# Log analyzer and interactive viewer for the Apache Webserver
brew "goaccess"
# Google Search and News from the command-line
brew "googler"
# Colorize logfiles and command output
brew "grc"
# Command-line hex viewer
brew "hexyl"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash completion for Homesick
brew "homesick-completion"
# Instant coding answers via the command-line
brew "howdoi"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Improved colored diff
brew "icdiff"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Program for recording a UNIX terminal session
brew "ipbt"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Tool for calculation of IP networks
brew "ipinfo"
# Interactive computing in Python
brew "ipython"
# Configure Jenkins jobs with YAML files stored in Git
brew "jenkins-job-builder"
# Command-line note taker
brew "jrnl"
# JSON parser and validator with a CLI
brew "jsonlint"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Bash completion for Launchctl
brew "launchctl-completion"
# Simple terminal UI for git commands
brew "lazygit"
# Sophisticated file transfer program
brew "lftp"
# SIXEL encoder/decoder implementation
brew "libsixel"
# C implementation of the XDG Base Directory specifications
brew "libxdg-basedir"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility to list open files
brew "lsof", link: true
# Macro processing language
brew "m4"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Shell for Maven
brew "maven-shell"
# Show markdown documents on text terminals
brew "mdcat"
# Command-line based markdown presentation tool
brew "mdp"
# Terminal-based visual file manager
brew "midnight-commander"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# Terminal based YouTube player and downloader
brew "mps-youtube"
# Media player based on MPlayer and mplayer2
brew "mpv", link: false
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Net top tool grouping bandwidth per process
brew "nethogs"
# Network grep
brew "ngrep"
# Realtime console network usage monitor
brew "nload"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Recreates the SETEC ASTRONOMY effect from 'Sneakers'
brew "no-more-secrets"
# ncurses based sudoku game
brew "nudoku"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Convert OpenDocument files to plain text
brew "odt2txt"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Bash completion for Packer
brew "packer-completion"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Simplistic interactive filtering tool
brew "peco"
# Interactive grep tool
brew "percol"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Bash completion for Pip
brew "pip-completion"
# Python dependency management tool
brew "pipenv"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Cowsay but with ponies
brew "ponysay"
# Monitor data's progress through a pipe
brew "pv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# GNU Make with improved error handling, tracing, and a debugger
brew "remake"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line Reddit client
brew "rtv"
# Bash completion for Ruby
brew "ruby-completion"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# FUSE-based file system backed by Amazon S3
brew "s3fs"
# Tool for shell commands execution, visualization and alerting
brew "sampler"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# HTTP regression testing and benchmarking utility
brew "siege"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line utility for posting snippets to Slack
brew "slackcat"
# Yet another network load monitor
brew "slurm"
# SOcket CAT: netcat on steroids
brew "socat"
# Bash completion for Sonar
brew "sonar-completion"
# Source-code syntax highlighter
brew "source-highlight"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# SQLite extension providing 256-bit AES encryption
brew "sqlcipher"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Feature-rich console based todo list manager
brew "task"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Command-line packet analyzer
brew "tcpdump"
# Active TCP connections monitoring tool
brew "tcpstat"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform State → Ansible Dynamic Inventory
brew "terraform-inventory"
# Ansible provisioner for Terraform
brew "terraform-provisioner-ansible"
# Improve Terraform's plan output
brew "terraform_landscape"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Export existing AWS resources to Terraform style (tf, tfstate)
brew "terraforming"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Tool providing extra functionality for Terraform
brew "terrahelp"
# Terraform automation and orchestration tool
brew "terrahub"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Shell completion for Tmuxinator
brew "tmuxinator-completion"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Ncurses-based presentation tool
brew "tpp"
# Command-line translator using Google Translate and more
brew "translate-shell"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Load testing for HTTP, PostgreSQL, Jabber, and others
brew "tsung"
# Digital clock in ncurses
brew "tty-clock"
# Unicode database query tool for the command-line
brew "uni"
# URL extractor/launcher
brew "urlview"
# Bash completion for Vagrant
brew "vagrant-completion"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Subversion-like utility to work with Jackrabbit FileVault
brew "vault-cli"
# Vi 'workalike' with many additional features
brew "vim"
# Terminal-based Tetris clone
brew "vitetris"
# Console-based network traffic monitor
brew "vnstat"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Command-line interface for WordPress
brew "wp-cli"
# Bash completion for Wpcli
brew "wp-cli-completion"
# Programs for accessing Microsoft Word documents
brew "wv"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# Command-line FTP client
brew "yafc"
# Linter for YAML files
brew "yamllint"
# Process YAML documents from the CLI
brew "yq"
# CLI tool for interacting with Zabbix monitoring system
brew "zabbix-cli"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Zsh curses-based tools, e.g. multi-word history searcher
brew "zsh-navigation-tools"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Debugger for zsh
brew "zshdb"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# Render markdown on the CLI
brew "charmbracelet/tap/glow"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# Tree command, improved.
brew "dduan/formulae/tre"
# It's like cat(1), but for images.
brew "eddieantonio/eddieantonio/imgcat"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
brew "hudochenkov/sshpass/sshpass"
# manage your git repositories in one place
brew "isacikgoz/taps/gitbatch"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# My rendition of the classic tetris.
brew "k-vernooy/tap/tetris", link: false
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# A terminal user interface for Spotify
brew "rigellute/tap/spotify-tui"
# Install the redis-cli only.
brew "ringohub/redis-cli/redis-cli"
# An automatic updater for ShadowFox
brew "srkomodo/tap/shadowfox-updater"
# Edit directly a file on Amazon S3 in CLI
brew "tsub/s3-edit/s3-edit"
# Fast, multipurpose tool for AWS CloudWatch Logs
brew "tylerbrock/saw/saw"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "0-ad"
cask "alacritty"
cask "android-platform-tools"
cask "authy"
cask "aws-vault"
cask "azure-data-studio"
cask "bitbar"
cask "bitwarden"
cask "chromium"
cask "cool-retro-term"
cask "cyberduck"
cask "dbeaver-community"
cask "docker"
cask "duet"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-3270-nerd-font-mono"
cask "font-anonymouspro-nerd-font"
cask "font-anonymouspro-nerd-font-mono"
cask "font-arimo-nerd-font"
cask "font-arimo-nerd-font-mono"
cask "font-aurulentsansmono-nerd-font"
cask "font-aurulentsansmono-nerd-font-mono"
cask "font-bitstreamverasansmono-nerd-font"
cask "font-bitstreamverasansmono-nerd-font-mono"
cask "font-codenewroman-nerd-font"
cask "font-codenewroman-nerd-font-mono"
cask "font-cousine-nerd-font"
cask "font-cousine-nerd-font-mono"
cask "font-dejavusansmono-nerd-font"
cask "font-dejavusansmono-nerd-font-mono"
cask "font-droidsansmono-nerd-font"
cask "font-droidsansmono-nerd-font-mono"
cask "font-fantasquesansmono-nerd-font"
cask "font-fantasquesansmono-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-firamono-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-hasklig-nerd-font"
cask "font-hasklig-nerd-font-mono"
cask "font-heavydata-nerd-font"
cask "font-heavydata-nerd-font-mono"
cask "font-hermit-nerd-font"
cask "font-hermit-nerd-font-mono"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "font-inconsolatago-nerd-font"
cask "font-inconsolatago-nerd-font-mono"
cask "font-inconsolatalgc-nerd-font"
cask "font-inconsolatalgc-nerd-font-mono"
cask "font-iosevka-nerd-font"
cask "font-iosevka-nerd-font-mono"
cask "font-lekton-nerd-font"
cask "font-lekton-nerd-font-mono"
cask "font-liberationmono-nerd-font"
cask "font-liberationmono-nerd-font-mono"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "font-monofur-nerd-font"
cask "font-monofur-nerd-font-mono"
cask "font-monoid-nerd-font"
cask "font-monoid-nerd-font-mono"
cask "font-mononoki-nerd-font"
cask "font-mononoki-nerd-font-mono"
cask "font-mplus-1mn-nerd-mono"
cask "font-mplus-nerd-font"
cask "font-mplus-nerd-font-mono"
cask "font-noto-nerd-font"
cask "font-noto-nerd-font-mono"
cask "font-profont-nerd-font"
cask "font-profont-nerd-font-mono"
cask "font-proggyclean-nerd-font"
cask "font-proggyclean-nerd-font-mono"
cask "font-robotomono-nerd-font"
cask "font-robotomono-nerd-font-mono"
cask "font-sharetechmono-nerd-font"
cask "font-sharetechmono-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-sourcecodepro-nerd-font-mono"
cask "font-spacemono-nerd-font"
cask "font-spacemono-nerd-font-mono"
cask "font-terminus-nerd-font"
cask "font-terminus-nerd-font-mono"
cask "font-tinos-nerd-font"
cask "font-tinos-nerd-font-mono"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-nerd-font-mono"
cask "font-ubuntumono-nerd-font"
cask "font-ubuntumono-nerd-font-mono"
cask "franz"
cask "hiddenbar"
cask "iterm2"
cask "java"
cask "keybase"
cask "kitty"
cask "lepton"
cask "mactex-no-gui"
cask "macvim"
cask "microsoft-edge-dev"
cask "microsoft-teams"
cask "mono-mdk"
cask "moter"
cask "mpv"
cask "p4v"
cask "pocket-casts"
cask "postman"
cask "powershell"
cask "qutebrowser"
cask "sfdx"
cask "shiftit"
cask "skype-for-business"
cask "snwe"
cask "soduto"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "taskwarrior-pomodoro"
cask "twitch"
cask "ubersicht"
cask "vagrant"
cask "vagrant-manager"
cask "vagrant-vmware-utility"
cask "virtualbox"
cask "visual-studio"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion10"
cask "zoomus"
mas "Anaxi", id: 1317534033
mas "Bitwarden", id: 1352778147
mas "Confluently", id: 1290720256
mas "CopyClip", id: 595191960
mas "Dark Reader for Safari", id: 1438243180
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Simplenote", id: 692867256
mas "Termius", id: 1176074088
mas "Trello", id: 1278508951
mas "uBlock", id: 1385985095
mas "WhatsApp", id: 1147396723
